src/ПодсистемаPAPI/Catalogs/PAPI_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>PAPI_ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стандартный</Name>
					<Comment>Сообщение создано PAPI</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ПодсистемаPAPI/Catalogs/PAPI_ШаблоныСообщений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
// Возвращает стандартную ошибку  
//
// Возвращаемое значение:
//   Структура:
//		КодСостояния - Код ответа 520
//		Сообщение - Текст ошибки
//
Функция ПолучитьСообщение502() Экспорт 
	
	ТекстСообщения = НСтр("ru = 'Неизвестная ошибка';
			|en = 'Unknown Error'");
	Результат = Новый Структура("КодСостояния, Сообщение", 520, ТекстСообщения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КодСостояния КАК КодСостояния,
		|   ТекстСообщения КАК Сообщение
		|ИЗ
		|	Справочник.PAPI_ШаблоныСообщений
		|ГДЕ
		|	Код = &Код
		|	И НЕ ПометкаУдаления
		|";
	Запрос.УстановитьПараметр("Код","UnErr520");
	
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаКодСостояния
	    Если Результат.КодСостояния <> ВыборкаДетальныеЗаписи.КодСостояния Тогда 
			Результат.КодСостояния = ВыборкаДетальныеЗаписи.КодСостояния;	
		КонецЕсли;

		Если ПустаяСтрока(ВыборкаДетальныеЗаписи.Сообщение) Тогда 
			Продолжить;
		КонецЕсли;   
		
		ТекстСообщения = НСтр(ВыборкаДетальныеЗаписи.Сообщение);
		Результат.Сообщение = ТекстСообщения;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли
